package Theory.A04_SpiskiIMapu.D003_Map;

import java.util.Scanner;

/**
 * Задание №5. Напишите программу, которая принимает на вход массив целых чисел и подсчитывает количество
 * вхождений каждого числа в массиве, используя HashMap. Затем выведите каждое число и его количество
 * вхождений в массиве.
 */
public class Task05 {
    public static void main(String[] args) {

    }
    public static void inputArray() {
        Scanner scanner = new Scanner(System.in);
        System.out.println("Введите целое число для записи его в массив: ");

    }

}

