package Theory.A04_SpiskiIMapu.D003_Map;

import java.util.ArrayList;
import java.util.HashMap;

/**
 * Напишите программу, которая будет принимать на вход строку и подсчитывать количество каждого символа в ней,
 * используя HashMap для хранения символов и их количества.
 */
public class Task02 {
    public static void main(String[] args) {
        String word = "паралалиндром";
        System.out.println(countingLetters(word));
    }
    public static HashMap<Integer, String> countingLetters (String word) {
        HashMap<Integer, String> countingLetters = new HashMap<>();

        return countingLetters;
    }
}
